setwd("C://LJH/Suwon_Security")
g_place<-read.csv(file="C://LJH/Suwon_Security/data/2016~2019_서울시_5대범죄_발생장소별_발생현황.csv",
                  header=T)

library(ggplot2)
place_2019<-g_place[g_place$기간=="2019",]

#데이터 전처리

crime <-c("살인","살인","살인","살인","살인","살인","살인","살인","살인","살인","살인","살인","살인",
        "강도","강도","강도","강도","강도","강도","강도","강도","강도","강도","강도","강도","강도",
        "성범죄","성범죄","성범죄","성범죄","성범죄","성범죄","성범죄","성범죄","성범죄","성범죄","성범죄","성범죄","성범죄",
        "절도","절도","절도","절도","절도","절도","절도","절도","절도","절도","절도","절도","절도",
        "폭력","폭력","폭력","폭력","폭력","폭력","폭력","폭력","폭력","폭력","폭력","폭력","폭력")

place <-c("아파트","연립주택","단독주택","노상","상점","숙박업소","목욕탕","유흥접객업소","사무실","역대합실","교통수단","유원지","학교",
         "아파트","연립주택","단독주택","노상","상점","숙박업소","목욕탕","유흥접객업소","사무실","역대합실","교통수단","유원지","학교",
         "아파트","연립주택","단독주택","노상","상점","숙박업소","목욕탕","유흥접객업소","사무실","역대합실","교통수단","유원지","학교",
         "아파트","연립주택","단독주택","노상","상점","숙박업소","목욕탕","유흥접객업소","사무실","역대합실","교통수단","유원지","학교",
         "아파트","연립주택","단독주택","노상","상점","숙박업소","목욕탕","유흥접객업소","사무실","역대합실","교통수단","유원지","학교")

freq<- c(25,36,26,1,7,9,4,0,0,2,0,0,26,
       7,12,36,22,7,19,4,1,3,2,0,1,22,
       533,552,946,178,528,968,128,255,966,54,49,3,1309,
       2455,2163,10198,8464,1297,3481,626,593,1156,649,363,1104,9655,
       5979,5994,21089,1427,558,5248,1141,675,1123,541,273,91,10174)

df<-data.frame(crime,place,freq)


#스택형 막대그래프 그리기
library(ggplot2)
library(plyr)

df<-ddply(df,"crime",transform,percent=freq/sum(freq)*100,3)
percent<-round(df$percent,2)
df<-df[,-3]
df<-cbind(df,percent)

ggplot(df,aes(x=crime,y=percent,fill=place))+
  geom_bar(stat="identity",colour="black")+
  geom_text(aes(y=percent,label=percent),position = position_stack(vjust=0.5),col="white",size=3)
  







